EDT/УТ/src/Documents/мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ/мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ</name>
  <comment>(Миго-групп)</comment>
  <registerRecords>InformationRegister.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанныхДляРасчетаФОТ</name>
    <type>
      <types>CatalogRef.мгИсточникиДанныхДляРасчетаФОТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеСотрудников</name>
    <attributes>
      <name>ФИОСотрудника</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТабельныйНомерВИсточнике</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/РаботникиОрганизации/РаботникиОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизации</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетВПроектнойДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СостояниеРаботникаОрганизации/СостояниеРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеРаботникаОрганизации</name>
  <enumValues>
    <name>ПринятНаРаботуВОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ/Forms/ФормаДокументаУпр/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.СоответствиеСотрудников.Количество() > 0 Тогда
		Если Вопрос("Документ будет перезаполнен! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЗаполнитьНаСервере();
		КонецЕсли;
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

	Объект.СоответствиеСотрудников.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботникиОрганизации.Организация КАК Организация,
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ втУволеные
	|ИЗ
	|	РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|ГДЕ
	|	РаботникиОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеРаботникаОрганизации.Уволен)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботникиОрганизации.Организация,
	|	РаботникиОрганизации.Сотрудник
	|ПОМЕСТИТЬ втРаботники
	|ИЗ
	|	РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|ГДЕ
	|	НЕ (РаботникиОрганизации.Организация, РаботникиОрганизации.Сотрудник) В
	|				(ВЫБРАТЬ
	|					втУволеные.Организация,
	|					втУволеные.Сотрудник
	|				ИЗ
	|					втУволеные КАК втУволеные)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРаботники.Сотрудник КАК Сотрудник
	|ИЗ
	|	втРаботники КАК втРаботники
	|ГДЕ
	|	втРаботники.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	
	
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//Запрос.УстановитьПараметр("ИсточникДанныхДляРасчетаФОТ", Объект.ИсточникДанныхДляРасчетаФОТ);
	
	Результат = Запрос.Выполнить();
	ВыборкаСотрудник = Результат.Выбрать();
	Пока ВыборкаСотрудник.Следующий() Цикл
		
		НоваяСтрока = Объект.СоответствиеСотрудников.Добавить();
		НоваяСтрока.ФИОСотрудника = ВыборкаСотрудник.Сотрудник;
				
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхДляРасчетаФОТПриИзменении(Элемент)
	Если не Объект.ИсточникДанныхДляРасчетаФОТ.ФСоединениеПротестировано тогда
		Сообщить("Выбранный источник данных не проверен! Обратитесь к администратору");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
КонецПроцедуры
